<template>
  <div>
  <div style="text-align: center; margin-top:20px;"><h2>Итоговое задание</h2><br></div>
    <p>Выберите тему для выполнения задания, например: ИС для оценки преподавателя (т.н. эффективный контракт),	ИС для оценки студента,	ИС клиент-банк.</p>
    <p>По выбранной теме выполните следующие задания:</p>
    <p>1.	Разобравшись с фрагментом предметной области описать задачу текстом в произвольной форме, но достаточно подробно. </p>
    <p>2.	Создать Use Case диаграммы UML.</p>
    <p>3.	В соответствии с технологией DDD описать текстом потоки данных.</p>
    <p>4.	Разбить ИС на модули, выписав их характеристики.</p>
    <p>5.	Построить схему базы данных. Выявить семантику данных.</p>
    <p>6.	На языке PL/SQL разработать процедурную компоненту ИС, в первую очередь систему триггеров. </p>
    <p>7.	Можно создать прототип интерфейса пользователя.</p>
    <p>8.	Определить ограничения на применимость создаваемой системы.</p>
    <p>9.	Желательно, но не обязательно, найти чужую программу, решающую поставленную задачу, при возможности запустить её, уточнить требования, пояснить структуру базы, сравнить с вашим решением.</p><br>
    <iframe src="https://forms.yandex.ru/u/65624244068ff05973ee39b8/?iframe=1" frameborder="0" name="ya-form-65624244068ff05973ee39b8" width="650"></iframe>
</div>
</template>


<script>
export default {
  name: 'FinalTask',
  props: {
      
  },
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>

</style>
