<template>
  <div>
  <div style="text-align: center; margin-top:20px;">
    <h2>Раздел 1. Бизнес-процессы, семантики и концептуальная модель данных</h2>
  </div>
  <br>
  <div>
    <h3>Содержание:</h3>
    <ul>
      <li>Бизнес-процессы</li>
      <li>Схема Закмана</li>
      <li>Концептуальные модели</li>
      <li>Семиотика. Прагматики и семантики данных.</li>
      <li>Проблема именования</li>
      <li>Структуры на атрибутах. Блоки.</li>
      <li>Уточнённая теорема Хиса</li>
      <li>Семантика изолированной сущности</li>
    </ul>
    <p /><p />
    <h3>Что такое бизнес-процессы</h3>
    <img src="../assets/1.png" style="width: 800px;"/><br>
    <img src="../assets/2.jpg" style="width: 800px;"/><br>
    <h3>Некоторые свойства бизнес-процессов</h3><br>
    <p>1. Выделение деятельностей:</p>
    <p style="padding-left: 40px;">1.1. по созданию ценностей;<br>
       1.2. по управлению процессом;<br>
       1.3. обеспечивающие другие деятельности.</p>
    <p>2. Выделение трёх видов потоков работ:</p>
    <p style="padding-left: 40px;">2.1. Основной (типичный, часто встречающийся, рекомендуемый процесс)<br>
       2.2. Альтернативные<br>
       2.3. Обслуживающие исключительные ситуации</p>
    <p>3. Затраты ресурсов (трудовых, финансовых, технических и др.)</p>
    <p>4. Особое внимание следует уделять так называемом сквозным процессом, охватывающим более одного подразделения</p>
    <p>Внедрение процессного подхода это не только моделирование и организация процессов. Определять и поддерживать уровень эффективности можно, только если определена адекватная бизнесу система показателей.</p>
    <p style="font-weight: bold;">Замечание: </p><p>Не следует понимать деятельность подразделения упрощённо как набор  выполняемых им бизнес-процессов, когда достаточно описать входы, выходы и функции по преобразованию входов в выходы.  В частности, должна работать система менеджмента качества. Необходим также анализ цепочек создания ценности и обеспечивающих процессов, не создающих ценности.</p>
    <h3>Ошибки при создании системы показателей</h3>
    <p>Перечислим некоторые ошибки, допускаемые при создании системы показателей:</p>
    <ul>
      <li>Отсутствие ориентации на стратегические цели организации, её результативность и эффективность</li>
      <li>Система процессов и показателей неадекватна реально существующему бизнесу</li>
      <li>Система показателей фрагментарна , то есть в ней отсутствуют некоторые показатели необходимые для управления</li>
      <li>Некоторые показатели противоречивы, то есть, достижение оптимального значения по одному показателю исключает достижения оптимума по другому</li>
      <li>Некоторые показатели слишком сильно связаны между собой</li>
    </ul><br>
    <p style="font-weight: bold;">Закон Гудхарта:</p>
    <p>Любая наблюдаемая статистическая закономерность склонна к разрушению, как только на неё оказывается давление с целью управления [экономикой].
      Иначе говоря, акторы системы всегда смогут улучшить требуемые показатели, не улучшая при этом работу самой системы.
    </p>
    <h3>2. Какие модели описывают бизнес. Схема Закмана</h3>
    <img src="../assets/3.png" style="width: 800px;"/><br><br>
    <h3>Многоаспектность информационных систем</h3><br>
    <p>Разработку ИС можно понимать как последовательность разработки моделей, начиная с вербально выраженной общей концепции будущей ИС (текстовое задание), через понимание ее концептуальной структуры (диаграммы UseCase),  к более детальным логическим и физическим моделям данных.</p>
    <p>Множественность точек зрения на ИС связана со сложностью ИС и со сложностью её восприятия в целом, с различиями в функционировании компонентов системы, с необходимостью предоставления разным группам пользователей различных моделей ИС, с поддержкой изменений.</p>
    <p>Сильно отличаются и сами разработчики: программисты, тестировщики, технические писатели, менеджеры, продавцы, маркетологи и т. д. Всем им нужна разная информация.</p>
    <p>Точки зрения менеджера проекта, финансиста, разработчика конкретного модуля системы, естественно, должны отличаться.</p>
    <p style="font-weight: bold;">Важно!</p> <p>При создании любой модели (диаграммы) необходимо определить точку зрения и представлять уровень диаграммы (или её место в схеме Захмана).</p>
    <h3>3. Концепт. Концептуальная модель</h3><br>
    <p>По довольно широко распространённой в информатике традиции термины "понятие" и "концепт"  воспринимаются как синонимы, может быть неполные.</p>
    <p>Мы будем различать эти термины.</p>
    <p>У термина "понятие"  имеется естественная коннотация "понимать, понимает". Поэтому понятие это тот образ сущности, или набора сущностей, который понимается некоторым “стандартным” человеком естественным образом. Если понятие используется в качестве опорного для задания семантики, то оно может быть не вполне определённым, но достаточным для описания этой семантики. Пример такого понятия - прецедент в UseCase диаграмме.</p>
    <p>Понятиям могут быть свойственны расплывчатость,  денотационная неясность и недоопределённость.</p>
    <p>Концепт -- естественная экспликация понятия в некотором контексте. Естественно, понятию с достаточно сложным десигнатом могут соответствовать несколько концептов.</p>
    <p>Концептуальная модель – это набор концептов и связей между ними, осмысленных в рассматриваемой предметной области. Модель включает взаимосвязанные концепты (сущности), их свойства и характеристики. Предполагается классификация компонентов по типам, ситуациям, ограничениям целостности. Исходя из концептуальной модели строится логическая модель базы данных.</p>
    <p>Концептуальная модель – это информационная модель предметной области, включающая  классификацию данных, их структуризацию и семантическую целостность (в том числе достоверность и согласованность данных).</p>
    <p>Наиболее известна  концептуальная модель “сущность-связь”. В ней два основных объекта – сущности и связи. Не все связи реализуются напрямую в логической модели.</p>
    <h3>4. Семиотика. Прагматики и семантики данных</h3><br>
    <p>Семио́тика, в лингвистике, философии – семиоло́гия</p>
    <p>(от греческого σημειωτική, от др.-греч. σημεῖον — «знак, признак») наука о коммуникативных системах и знаках, используемых в процессе общения (Лотман Ю.М.).</p>
    <p>Три основных аспекта изучения знака и знаковой системы:</p>
    <p>синтаксис (синтактика) изучает внутренние свойства систем знаков безотносительно к интерпретации знака или системы знаков; синтактика включает синтагматику (это сочетаемость знаков) и парадигматику (строение языковых единиц)</p>
    <p>семантика (в лингвистике семасиология) определяет отношение знаков к обозначаемому объекту (см. денотат и десигнат);</p>
    <p>прагматика определяет интерпретацию знака в зависимости от точки зрения, выбранного аспекта знака, приемлемости, полезности или ценности знака для интерпретатора.</p>
    <p>Денотат единицы языка — это множество объектов действительности именуемых этой единицей.  Соответствует термину “объём понятия” в классической логике.</p>
    <p>Десигнат — означаемое, то есть, значение слова. Противопоставляется денотату как “субъективный образ” или “концепт” денотата. Понятия могут иметь десигнат, но не иметь денотата. Примеры: “русалка”, ”круглый квадрат“. </p>
    <p>Как писал Ч.Моррис, “Знаки, указывающие на один и тот же объект, не обязательно имеют те же самые десигнаты, поскольку то, что учитывается в объекте, у разных интерпретаторов может быть различным” [“Основания теории знаков”].</p>
    <p>В базах данных, как правило, денотат определяется однозначно, а десигнат может варьировать исходя из выбранной прагматики.</p>
    <h3>Синтаксис, семантики и прагматики</h3>
    <img src="../assets/4.jpg" style="width: 600px;"/><br><br>
    <h3>Какие виды семантик мы будем изучать</h3><br>
    <p>Сначала вспомним, что такое активность. Будем говорить, что база данных активна, если она выполняет не только действия явно предписанные при обращении к ней, но и какие-то другие действия в рамках, определённых используемой семантикой данных.</p>
    <p>Как выполняется, например, вставка данных в таблицу с первичным ключом. Сначала проверяется синтаксическая правильность инструкции. Если она подтверждена, СУБД проверяет существование таблицы, наличие столбцов, совместимость типов и пр. Наконец, выясняется, не возникнет ли дублирование ключа, не нарушаются ли другие ограничения целостности. Заметим, что все эти виды активности в инструкции явно не задавались, а были определены семантикой, использованной при создании таблицы.</p>
    <p>В дальнейшем будет использована в основном модельная семантика, представляемая как расширение теоретико-модельной семантики, определенной через отображение знака на/в некоторую опорную не обязательно чёткую модель.</p>
    <p>Выделим следующие виды семантик для структурированных моделей:</p>
    <p>1. Встроенные вендорами в физическую модель. Это типы данных, ограничения целостности, более широко, метаданные. Требуют активности СУБД. Бывают декларативные и процедурные.</p>
    <p>2. Семантики концептуальной модели, у которых опорная модель это описание бизнес-процессов или их фрагментов. Предполагает аспект в некотором смысле правильного отображения предметной области в базе данных. Активности быть не может, если опорная модель не представлена эксплицитно.</p>
    <p>3. Семантики логического или физического уровней  с опорной моделью в виде некоторого представления структуры данных и аппаратных средств. Позволяют рассматривать аспекты быстродействия и масштабируемости. Активности нет, либо она очень ограничена.</p>
    <p>4.  Семантики отражающие особенности измерений атрибутов или семантики добавленные пользователем. Опорная модель связана с обработкой, а не с хранением данных. Может требовать активности СУБД, но часто интерпретируется человеком.</p>
    <p>5. Семантики связанные с эмуляцией других моделей данных. Типичный пример – представление деревьев в таблицах. Может потребовать активности.</p>
    <br><h3>Модельная семантика</h3><br>
    <p>Модельная семантика в нашем понимании задаётся через отображения изучаемого объекта на некоторую опорную модель, базисную для изучаемой семантики.</p>
    <p>Модельная семантика S включает опорную модель M и отображение интерпретации I:</p>
    <p>S = 〈M, I〉</p>
    <p>где  </p>
    <p>M – опорная модель, на/в которую производится отображение; обязательное условие – существенность для выявления семантики.</p>
    <p>I – отображение интерпретации, в частном случае это биекция.</p>
    <p>Термин “опорная модель” понимается в самом широком смысле и включает в себя алгебраические модели (тогда говорим о теоретико-модельной семантике), вычислительные модели Э.Х. Тыугу, модели бизнес-процессов, фрагменты этих моделей и многое другое. </p>
    <p>Для опорной модели не всегда требуется полнота описания. Могут использоваться, например, фрагменты диаграмм прецедентов, или текстовые описания некоторой части системы или просто собрание индивидов со свойствами и связями.</p>
    <p>Возможны модели состоящие из мало связанных компонентов, иначе говоря, модель не обязательно должна быть представима как хороший контекст или сильно зацеплённый модуль. </p>
    <p>Заметим, что краткий вопрос «Какой смысл имеет X?» сам по себе не осмыслен. Его следует уточнить: “Какой смысл имеет X в семантике S (или модели M)?” </p>
    <p style="font-weight: bold;">Замечание:</p><p>В алгебре наиболее общая конструкция это алгебраическая система, т.е. некоторое множество с определёнными на нём наборами отношений и операций.  Модели представляют собой частный случай таких систем, характеризующиеся отсутствием операций.</p>
    <br><h3>5. Проблема именования.</h3><br>
    <p>Концепт отражает наиболее существенные свойства, связи и отношения предметов, процессов и явлений некоторого фрагмента предметной области (ограниченного контекста в терминах DDD). </p>
    <p>Понятие/концепт может выражаться словом (например, название столбца “Имя”), словосочетанием (например, название столбца “Дата приёма на работу”), предложением (например, название таблицы emp “Это отчёт о  приёме на работу”) и даже в виде сложного синтаксического целого.</p>
    <p>Пример ССЦ для семантики таблицы emp: </p>
    <p>Таблица содержит записи приёмов сотрудников на работу. Может использоваться как отчёт. Не может использоваться как основная таблица со сведениями о сотрудниках для отдела кадров, так как не отражает основные варианты её использования: приём, увольнение и перевод сотрудника.</p>
    <p>Имена объектов базы, в том числе коллекций и таблиц могут выбираться из соображений удобства для программиста. Как минимум эти имена не будут правильно и полностью отображать семантику, как максимум, могут пониматься искажённо. В этом случае семантика должна быть раскрыта комментариями в словаре или же реализовываться другими компонентами ИС.</p>
    <p>Термин/концепт – будет пониматься как обозначение строго определённого понятия, выражаемое словом или словосочетанием. В пределах некоторой предметной области (ограниченного контекста) термин понимается однозначно.</p>
    <p>В соответствии с принципом композициональности изменения в столбцах могут вызвать изменение семантики (смысла) всей таблицы.</p>
    <br><h3>6. Сорта атрибутов в концептуальной модели</h3><br>
    <p>В реляционной модели данных неявно предполагается, что сущности вещные (не процессные) а все атрибуты отношения односортны и конкатенируются (как то объединяются) только в ключах. </p>
    <p>Фактически используемая табличная модель характеризуется тем, что в ней атрибуты разносортны, не обязательно независимы, могут иметь нетрадиционную семантику; кроме ключевых, существуют другие  конкатенированные группы атрибутов, может быть пересекающиеся.</p>
    <p>Будем выделять следующие сорта атрибутов:</p>
    <ul>
      <li>Ключевые атрибуты (играют роль уникальных идентификаторов или ключей связи).</li>
      <li>Атрибуты состояния (не ключевые и не темпоральные). </li>
      <li>Поясняющие атрибуты, в том числе описывающие тексты, особенности измерений и виды шкал.</li>
      <li>Атрибуты темпоральные (типов “Дата”, “Время” и атрибуты, хранящие историю значений).</li>
      <li>Атрибуты-ресурсы, характеризующие объем ресурса которым сущность владеет, но который не является её компонентом. Можно использовать ещё контейнер ресурса.</li>
      <li>Атрибуты, отражающие особенности вариативных объектов (значимость результата, взаимозависимости атрибутов, нетрадиционная семантика, например, симптомы-запретители). </li>
      <li>Атрибуты вычислимые как функции или связанные отношениями в одном кортеже.</li>
      <li>Атрибуты вычислимые по данным нескольких кортежей, находящихся, быть может, в нескольких отношениях. Простейший пример -- нарастающий итог.</li>
      <li>Атрибуты вводимые пользователем для расширения семантики данных. По способу прикрепления разделяются на ячеечные, строчные, столбцовые, табличные.</li>
    </ul><br>
    <h3>Блоки атрибутов</h3><br>
    <p>Несколько атрибутов сущности могут образовывать блок, если на нём можно выделить элемент семантики, естественный в контексте, с которым оперируют.</p>
    <p>Добавление или удаление атрибута к блоку может менять его семантику, или сохранить её.</p>
    <p>Далее под термином блок будет пониматься такой набор атрибутов, что удаление хотя бы одного атрибута разрушает или изменяет семантику блока.</p>
    <p>Блок имеет трёхчастную структуру:</p>
    <ul>
      <li>первая компонента указывает к чему прикрепляется блок;</li>
      <li>вторая указывает какие значения смыслов прикрепляются;</li>
      <li>третья компонента – роли блоков и входящих в них двух предыдущих компонент; часто отсутствует, иногда содержится вне сущности, например, в метаданных (в словаре) и в комментариях; часто эта компонента предполагается, но не фиксируется в схеме.</li>
    </ul>
    <p>Вторая и третья компоненты могут быть конкатенированным набором столбцов.</p>
    <p>Пример: PK. Прикрепляется к строке. Значение смысла – значение ключа. Роль описана в словаре.</p>
    <p>Блоки могут образовываться композициями других блоков, в частности вкладываться один в другой. Виды композиции сущностей в предметной области:</p>
    <ul>
      <li>сборка; компоненты легко выделяются и вновь собираются;</li>
      <li>агрегация; компоненты различимы, но трудно разделяются; пример: слоёный торт;</li>
      <li>смешивание; компоненты не разделяются после соединения;</li>
      <li>сопоставление; расположение объектов в фиксированном пространственном отношении без их соединения; самая слабая связь между компонентами; пример: сервировка стола;</li>
    </ul>
    <p>Реализация ряда композиций в БД невозможна или требует значительных усилий.</p>
    <br><h3>Блоки атрибутов для предметных сущностей</h3><br>
    <p>Чем образуется блок:</p>
    <ul>
      <li>Функцией (обычной, MV, проекция-соединение) определённой на атрибутах и работающими с данными одной строки.</li>
      <li>Вычисляемыми столбцами работающими с данными многих строк; пример: нарастающий итог.</li>
      <li>Отношением, определенным на атрибутах и работающим с данными одной строки. Пример: ограничение целостности CHECK().</li>
      <li>Наличием поясняющих атрибутов, либо некоторых смыслов заданных пользователем.</li>
      <li>Набором атрибутов со сходной семантикой и, соответственно со сходным обращением с ними, по сути представляет иерархию, корневой элемент которой даёт название и определяет семантику новой выделенной таблицы; набор имен столбцов преобразуется шаблоном «Транспонирование таблицы с расширяемым набором столбцов в таблицу с  расширяемым числом строк» используемым, в частности, в алгоритме нормализации для 1НФ.</li>
      <li>Составной атрибут, представляющий скрытый блок состоящий из атрибутов имеющих общую  часть семантики. Его необходимо разделить на компоненты из блоков, либо из отдельных простых или конкатенированных атрибутов.</li>
    </ul>
    <br><h3>Примеры блоков атрибутов</h3><br>
    <p>1. Всем известны блоки атрибутов образующиеся первичными и внешними ключами, может быть, конкатенированными . У ПК -- прикрепление к строке, сам ключ – это значение смысла ПК, роль блока прописана в метаданных.</p>
    <p>2. Все неключевые атрибуты образуют блок состояния сущностей.  Выделим среди них:</p>
    <ul>
      <li>блоки без темпоральных столбцов относящиеся ко времени существования сущности,</li>
      <li>блоки с темпоральными столбцами обозначающими единственный период времени – отрезок или полуинтервал.</li>
    </ul>
    <p>Такие блоки могут входить в блок ключевых атрибутов если для одного экземпляра сущности  предусмотрено несколько периодов.</p>
    <p>3. Семантика темпорального атрибута (например, для Oracle старых версий):</p>
    <p>Вариант 1 --  временная метка находящаяся вне рассматриваемого промежутка времени ( это атрибут состояния); пример – дата рождения сотрудника.</p>
    <p>Вариант 2 --  единственная временная метка имеющая смысл -- время с которого существует или перестает существовать экземпляр сущности.</p>
    <p>Вариант 3 --  две временных метки могут обозначать неповторяющиеся интервалы времени.</p>
    <p>Вариант 4 --  часть атрибутов относится ко времени обозначенному меткой, а остальная часть определяет атрибуты, не зависящая от времени</p>
    <p>Если все атрибуты кроме идентификатора имени экземпляра имеют постоянные значения в заданные в ключе периоды времени, то такая сущность реализует шаблон «Атрибуты изменяющиеся во времени”.</p>
    <h3>7. Уточнённая теорема Хиса. Контрпример. </h3><br>
    <p>Вспоминаем: Теорема Хиса доказана для реляционной модели, не используемой в настоящее время в СУБД, а применяют её к концептуальным, чаще к логическим и к табличным моделям. Отсюда проблемы!</p>
    <p>Пример: В отношении имеются атрибуты “зарплата” и “допустимые комиссионные”. Последние вычисляются по некоторой формуле </p>
    <p>допустимые_комиссионные = F(зарплата)</p>
    <p>как зависимость от зарплаты. </p>
    <p>Выделив функцию “зарплата”->“допустимые комиссионные” </p>
    <p>получаем по теореме Хиса некоторый набор экземпляров новой сущности с “плохой” семантикой. Например, такой: “примеры зависимости допустимых комиссионных от зарплаты”.</p>
    <p>Заметим, что вычислимые и автоинкрементные атрибуты в реляционной теории отсутствуют, но в практике используются часто.</p>
    <p>Вывод: В правилах нормализации основанных на теореме Хиса образованные сущности должны иметь приемлемую семантику.</p>
    <p>Пример: Придумайте семантику для сущности в которой, кроме всего прочего, есть два атрибута: “вес” и “единица измерения”. Как связаны эти атрибуты? Можно ли выделить их в отдельную сущность?</p>
    <h3>Уточнённая теорема Хиса</h3>
    <p>Теорема Хиса (стандартная формулировка): Пусть в отношении r со схемой R(S), где S – полный набор атрибутов отношения, выделены три набора атрибутов A, B, C таких, что A ∩ B = Ø, A ∩ C = Ø, B ∩ C = Ø , A ∪ B ∪ C = S. Тогда, если существует функциональная зависимость, действующая из набора B в С, то проекции proj {A,B} (r), proj {B,C} (r) образуют полную декомпозицию отношения r.</p>
    <p>Расширенная формулировка предполагает, что выявлена семантика атрибутов отношения и всего отношения, том числе выявлены блоки атрибутов, объединённых по смыслу.</p>
    <p>Ограничение (почти очевидное): Не следует применять декомпозицию по Хису в случае, когда атрибуты B образуют первичный ключ.</p>
    <p>Теорема Хиса (полная формулировка): Пусть в отношении r со схемой R(S), где S – полный набор атрибутов отношения, выделены три набора атрибутов A, B, C таких, что A ∩ B = Ø, A ∩ C = Ø, B ∩ C = Ø , A ∪ B ∪ C = S. Тогда, если существует функциональная зависимость, действующая из набора B в С, и проекции proj {A,B} (r), proj {B,C} (r) имеют смысл в принятой семантике, то они образуют полную декомпозицию отношения r.</p>
    <br><h3>Информация, данные, семантика и смыслы</h3><br>
    <p>Семантика определяет значение данных, смыслы, которые им придаются. В базах данных семантика встроенная вендорами определяется метаданными, включая структуры, типы данных и ограничения целостности.</p>
    <p>Семантика определяется прагматикой и потому может задаваться не обязательно  единственным образом. Два главных варианта: </p>
    <p>-- семантики определённые с точки зрения соответствия: а) концептуальной модели или б) моделям  бизнес-процессов; определяет смыслы данных;</p>
    <p>-- семантика с точки зрения соответствия: а) логической/физической модели б) моделям систем запросов и манипуляций данными на выбранной архитектуре реализации; определяет, например, необходимость и варианты денормализации.</p>
    <p>Дополнительная семантика может быть введена с помощью особого сорта данных, которые представляют смыслы других данных. Отличие смыслов от обычных данных (в базах данных) в степени активности. Данные пассивны, а любые смыслы активны.</p>
    <p>Значения введённых смыслов это данные этих смыслов.</p>
    <img src="../assets/5.png" style="width: 600px;"/><br><br>
    <br><h3>Контрольные вопросы</h3><br>
    <p>1. По таблице «Сотрудники» определите количество сотрудников работающих в отделе №30</p>
    <img src="../assets/6.png" style="width: 600px;"/><br><br>
    <p>2. Как следует назвать или охарактеризовать эту таблицу? Дайте текст названия или комментария одной фразой. Название может быть кратким, например, emp, но смыслы данных должны быть выявлены.</p>
    <p>3. А можно ли использовать эту единственную таблицу как базу данных  Human Resouces?</p>
    <p>4. Попробуйте определить понятие “посетитель сайта” и задайте его атрибуты.</p>
    <p>5. Вспомните, как звучат принципы композиональности и контекса.</p>
    <br><h3>Задание 1</h3><br>
    <p>1. Выяснить семантику схемы данных.</p>
    <p>2. Если необходимо, внести изменения в схему с тем, чтобы она имела реалистическую семантику.</p>
    <p>3. Найти все ключи и необходимые ограничения целостности.</p>
    <p>4. Нормализовать схему до 3НФ.</p>
    <br><h3>Пример:</h3><br>
    <p>Схема Книги</p>
    <img src="../assets/9.png" style="width: 600px;"/><br><br>
    <br><h3>Решение:</h3><br>
    <p>Переведём из не реляционной в реляционную:</p>
    <img src="../assets/10.png" style="width: 600px;"/><br>
    <p>Нарушается принцип атомарности: Автор, Редактор выражаются списками.</p>
    <img src="../assets/11.png" style="width: 600px;"/><br>
    <p>Таблица Книги</p>
    <img src="../assets/12.png" style="width: 600px;"/><br>
    <p>Таблица Книги-Авторы</p>
    <img src="../assets/13.png" style="width: 600px;"/><br>
    <p>Таблица Книги-Редакторы</p>
    <img src="../assets/14.png" style="width: 600px;"/><br>
    <p>Таблица Категория</p>
    <img src="../assets/15.png" style="width: 600px;"/><br>
    <br><h3>Задания для самостоятельного решения:</h3><br>
    <p>1.</p>
    <img src="../assets/7.png" style="width: 600px;"/><br>
    <p>2.</p>
    <img src="../assets/8.png" style="width: 600px;"/><br>
  </div><br><br>
  <div>
    <iframe src="https://forms.yandex.ru/u/6560c9f790fa7b32bf3541aa/?iframe=1" frameborder="0" name="ya-form-6560c9f790fa7b32bf3541aa" width="650"></iframe>
  </div>
</div>
</template>


<script>
export default {
  // eslint-disable-next-line
  name: 'Section1',
  props: {
      
  },
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>

</style>
